scene :p2 => "2" do
	character :a => "小小"
	character :b => "道长"
	character :c => "大黄"
	
	say "小小赶到了家中"
	b.sprite "0", 1
	say "啊，碰到了躶体的道长"
	select do
		choice "咦！道长你怎么没有穿衣服呀？" do
			b "我在家不是一直不穿衣服的么？"
			a "是么？为什么我一直没看到过呢？"
			b "你平时盯着我那个地方看这么久，怎么事后还装失忆呢！"
			a "啊！是么……我怎么一点印象都没有？"
			say "啪！"
			say "啪！啪！啪！"
		end
		choice "哦！道长，今天你格外可爱呀~" do
			b "装什么，你心里想着什么我还不知道么？"
			a "是么？那你是不是知道我想要上你呀？"
			b "O ∩_∩ O~我早就准备好了，来吧~"
			a "那……"
			say "啪！啪！啪！"
		end
	end
	say "大黄突然走了进来"
	c.sprite "0", 0
	c "额……你们门没有关……"
	c "你们……居然……在……"
	a "大黄……怎么……"
	c "小小，你居然……"
	b "……"
	a "没事，我们一起来怎么样~"
	c "那……好吧 ∩_∩"
	say "啪！啪！啪！啪！啪！啪！啪！啪！啪！啪！啪！"
	say "啪！啪！啪！啪！啪！啪！啪！啪！啪！啪！啪！"
	say "然后大家都再也没有见过这三个人。"
	
	fin
end